cmsis-svd/cmsis-svd/data/NXP/LPC13Uxx.svd
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>STARTERP1</name>																					
		<description>Start logic 1 interrupt wake-up enable register 1</description>																					
		<addressOffset>0x214</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>WWDTINT</name>																			
				<description>WWDT interrupt wake-up</description>																			
				<bitRange>[12:12]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>DISABLED</name>																	
						<description>Disabled</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>ENABLED</name>																	
						<description>Enabled</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>BODINT</name>																			
				<description>Brown Out Detect (BOD) interrupt wake-up</description>																			
				<bitRange>[13:13]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>DISABLED</name>																	
						<description>Disabled</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>ENABLED</name>																	
						<description>Enabled</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved</description>																			
				<bitRange>[18:14]</bitRange>																			
																		
			</field>																				
			<field>																				
				<name>USB_WAKEUP</name>																			
				<description>USB need_clock signal wake-up</description>																			
				<bitRange>[19:19]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>DISABLED</name>																	
						<description>Disabled</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>ENABLED</name>																	
						<description>Enabled</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>GPIOINT0</name>																			
				<description>GPIO GROUP0 interrupt wake-up</description>																			
				<bitRange>[20:20]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>DISABLED</name>																	
						<description>Disabled</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>ENABLED</name>																	
						<description>Enabled</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>GPIOINT1</name>																			
				<description>GPIO GROUP1 interrupt wake-up</description>																			
				<bitRange>[21:21]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>DISABLED</name>																	
						<description>Disabled</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>ENABLED</name>																	
						<description>Enabled</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>PDSLEEPCFG</name>																					
		<description>Power-down states in deep-sleep mode</description>																					
		<addressOffset>0x230</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0x00000000</resetMask>																					
		<fields>																					
			<field>																				
				<name>BOD_PD</name>																			
				<description>BOD power-down control for Deep-sleep and Power-down mode</description>																			
				<bitRange>[3:3]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>POWERED_DOWN</name>																	
						<description>Powered down</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>POWERED</name>																	
						<description>Powered</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>WDTOSC_PD</name>																			
				<description>Watchdog oscillator power-down control for Deep-sleep and Power-down mode</description>																			
				<bitRange>[6:6]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>POWERED_DOWN</name>																	
						<description>Powered down</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>POWERED</name>																	
						<description>Powered</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved</description>																			
				<bitRange>[31:7]</bitRange>																			
																			
