cmsis-svd/cmsis-svd/data/NXP/LPC13Uxx.svd
				</field>
				<field>
					<name>DSUS</name>
					<description>Device status - suspend.  The suspend bit indicates the current suspend state. It is set to 1 when the device hasn't seen any activity on its upstream port for more than 3 milliseconds. It is reset to 0 on any activity. When the device is suspended (Suspend bit DSUS = 1) and the software writes a 0 to it, the device will generate a remote wake-up. This will only happen when the device is connected (Connect bit = 1). When the device is not connected or not suspended, a writing a 0 has no effect. Writing a 1 never has an effect.</description>
					<bitRange>[17:17]</bitRange>

				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[18:18]</bitRange>

				</field>
				<field>
					<name>LPM_SUS</name>
					<description>Device status - LPM Suspend.  This bit represents the current LPM suspend state. It is set to 1 by HW when the device has acknowledged the LPM request from the USB host and the Token Retry Time of 10us has elapsed. When the device is in the LPM suspended state (LPM suspend bit = 1) and the software writes a zero to this bit, the device will generate a remote walk-up. Software can only write a zero to this bit when the LPM_REWP bit is set to 1. HW resets this bit when it receives a host initiated resume. HW only updates the LPM_SUS bit when the LPM_SUPP bit is equal to one.</description>
					<bitRange>[19:19]</bitRange>

				</field>
				<field>
					<name>LPM_REWP</name>
					<description>LPM Remote Wake-up Enabled by USB host.  HW sets this bit to one when the bRemoteWake bit in the LPM extended token is set to 1. HW will reset this bit to 0 when it receives the host initiated LPM resume, when a remote wake-up is sent by the device or when a USB bus reset is received. Software can use this bit to check if the remote wake-up feature is enabled by the host for the LPM transaction.</description>
					<bitRange>[20:20]</bitRange>

				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[23:21]</bitRange>

				</field>
				<field>
					<name>DCON_C</name>
					<description>Device status - connect change.  The Connect Change bit is set when the device's pull-up resistor is disconnected because VBus disappeared. The bit is reset by writing a one to it.</description>
					<bitRange>[24:24]</bitRange>

				</field>
				<field>
					<name>DSUS_C</name>
					<description>Device status - suspend change.  The suspend change bit is set to 1 when the suspend bit toggles. The suspend bit can toggle because: - The device goes in the suspended state  - The device is disconnected - The device receives resume signaling on its upstream port.  The bit is reset by writing a one to it.</description>
					<bitRange>[25:25]</bitRange>

				</field>
				<field>
					<name>DRES_C</name>
					<description>Device status - reset change.  This bit is set when the device received a bus reset. On a bus reset the device will automatically go to the default state (unconfigured and responding to address 0). The bit is reset by writing a one to it.</description>
					<bitRange>[26:26]</bitRange>

				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[27:27]</bitRange>

				</field>
				<field>
					<name>VBUSDEBOUNCED</name>
					<description>This bit indicates if Vbus is detected or not. The bit raises immediately when Vbus becomes high. It drops to zero if Vbus is low for at least 3 ms. If this bit is high and the DCon bit is set, the HW will enable the pull-up resistor to signal a connect.</description>
					<bitRange>[28:28]</bitRange>

				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:29]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>INFO</name>
			<description>USB Info register</description>
			<addressOffset>0x004</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>FRAME_NR</name>
					<description>Frame number. This contains the frame number of the last successfully received SOF. In case no SOF was received by the device at the beginning of a frame, the frame number returned is that of the last successfully received SOF. In case the SOF frame number contained a CRC error, the frame number returned will be the corrupted frame number as received by the device.</description>
					<bitRange>[10:0]</bitRange>

				</field>
				<field>
					<name>ERR_CODE</name>
					<description>The error code which last occurred:</description>
					<bitRange>[14:11]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_ERROR</name>
							<description>No error</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PID_ENCODING_ERROR</name>
							<description>PID encoding error</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PID_UNKNOWN</name>
							<description>PID unknown</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PACKET_UNEXPECTED</name>
							<description>Packet unexpected</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TOKEN_CRC_ERROR</name>
							<description>Token CRC error</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DATA_CRC_ERROR</name>
							<description>Data CRC error</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TIME_OUT</name>
							<description>Time out</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>BABBLE</name>
							<description>Babble</description>
							<value>0x7</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TRUNCATED_EOP</name>
							<description>Truncated EOP</description>
							<value>0x8</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SENT_RECEIVED_NAK</name>
							<description>Sent/Received NAK</description>
							<value>0x9</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SENT_STALL</name>
							<description>Sent Stall</description>
							<value>0xA</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OVERRUN</name>
							<description>Overrun</description>
							<value>0xB</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SENT_EMPTY_PACKET</name>
							<description>Sent empty packet</description>
							<value>0xC</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>BITSTUFF_ERROR</name>
							<description>Bitstuff error</description>
							<value>0xD</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SYNC_ERROR</name>
							<description>Sync error</description>
							<value>0xE</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>WRONG_DATA_TOGGLE</name>
							<description>Wrong data toggle</description>
							<value>0xF</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[15:15]</bitRange>

